#include "Option.h"
#include "CPrint.h"
#include <windows.h>
#include <string>
#include "Cinema.h"
#include "CZone.h"
#include "CPerson_Info.h"
#include "CMovie_Info.h"


int main(){
    
    CZone zones[ZONE_NUM];


    CMovie_Info movies[MOVIES_NUM]={CMovie_Info("어벤져스", 6), CMovie_Info("소울", 6), CMovie_Info("광해", 6), CMovie_Info("어바웃 타임",6)};
    
    
    CPerson_Info people[PEOPLE_NUM];
    std::string names[PEOPLE_NUM]={"강기수","강남규","강다연","강성령","강수진","강지원","강형창","고석영","공소명","곽민재",
                                   "구희태","권수현","권철호","김강산","김규태","김근우","김기현","김도욱","김도훈","김동명",
                                   "김동환","김리아","김민관","김민주","김민철","김상윤","김서연","김서영","김선득","김성범",
                                   "김순준","김영락","김우정","김우형","김은진","김정욱","김정윤","김주연","김지선","김지영",
                                   "김지우","김지한","김지현","김진혁","김형진","김호연","김효명","김휘영","남금내","노유진",
                                   "류기완","류현태","명호성","문병승","박광호","박근형","박도현","박동녘","박상현","박유정",
                                   "박은혜","박재석","박제훈","박찬호","박혜민","배주예","백창현","서윤석","서정민","석기은",
                                   "선우윤","성의현","손희진","송규영","송민지","송채현","신동승","안병윤","안서영","안윤지",
                                   "안윤혜","양효준","양희주","여무한","염경은","오미진","오인성","오재익","우혁상","유미라",
                                   "유병선","유솔지","유용준","유정식","유지선","유호선","윤국로","윤기애","윤원건","윤희철"};
                                       
    std::string phonenumber[PEOPLE_NUM]={"","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","","",
                                         "","","","","","","","","",""};
    bool gender[PEOPLE_NUM]={1,0,1,0,1,0,1,0,1,1,
                             1,1,1,1,1,0,0,0,0,0,
                             0,1,0,1,0,0,1,0,1,0,
                             0,1,1,0,1,0,1,0,1,0,
                             0,0,0,1,1,1,0,1,0,1,
                             1,0,0,1,0,0,1,1,1,0,
                             1,0,1,0,1,0,1,0,1,0,
                             0,1,0,1,0,1,0,1,0,1,
                             0,0,0,1,1,1,0,0,1,0,
                             1,0,1,0,1,0,1,0,1,1};
    
    Cinema cinema();



    return 0;
}